// demo 测试接口
module.exports = async (ctx, next) => {
    ctx.state = {
        code: 200,
        data: [{
            id: 1,
            author: '瑞·达利欧',
            book: '原则',
            moto: ' 一个人要以清晰的心智和从容的步履走过岁月,他的精神中不能缺少淡泊.'
        }, {
            id: 2,
            author: '瑞·达利欧',
            book: '原则',
            moto: ' 一个人要以清晰的心智和从容的步履走过岁月,他的精神中不能缺少淡泊.'
        }, {
            id: 3,
            author: '瑞·达利欧',
            book: '原则',
            moto: ' 一个人要以清晰的心智和从容的步履走过岁月,他的精神中不能缺少淡泊.'
        }, {
            id: 4,
            author: '瑞·达利欧',
            book: '原则',
            moto: ' 一个人要以清晰的心智和从容的步履走过岁月,他的精神中不能缺少淡泊.'
        }, {
            id: 5,
            author: '瑞·达利欧',
            book: '原则',
            moto: ' 一个人要以清晰的心智和从容的步履走过岁月,他的精神中不能缺少淡泊.'
        }, {
            id: 6,
            author: '瑞·达利欧',
            book: '原则',
            moto: ' 一个人要以清晰的心智和从容的步履走过岁月,他的精神中不能缺少淡泊.'
        }, {
            id: 7,
            author: '瑞·达利欧',
            book: '原则',
            moto: ' 一个人要以清晰的心智和从容的步履走过岁月,他的精神中不能缺少淡泊.'
        }, {
            id: 8,
            author: '瑞·达利欧',
            book: '原则',
            moto: ' 一个人要以清晰的心智和从容的步履走过岁月,他的精神中不能缺少淡泊.'
        }, {
            id: 9,
            author: '瑞·达利欧',
            book: '原则',
            moto: ' 一个人要以清晰的心智和从容的步履走过岁月,他的精神中不能缺少淡泊.'
        }, {
            id: 10,
            author: '瑞·达利欧',
            book: '原则',
            moto: ' 一个人要以清晰的心智和从容的步履走过岁月,他的精神中不能缺少淡泊.'
        }, {
            id: 11,
            author: '瑞·达利欧',
            book: '原则',
            moto: ' 一个人要以清晰的心智和从容的步履走过岁月,他的精神中不能缺少淡泊.'
        }, {
            id: 12,
            author: '瑞·达利欧',
            book: '原则',
            moto: ' 一个人要以清晰的心智和从容的步履走过岁月,他的精神中不能缺少淡泊.'
        }, {
            id: 13,
            author: '瑞·达利欧',
            book: '原则',
            moto: ' 一个人要以清晰的心智和从容的步履走过岁月,他的精神中不能缺少淡泊.'
        }, {
            id: 14,
            author: '瑞·达利欧',
            book: '原则',
            moto: ' 一个人要以清晰的心智和从容的步履走过岁月,他的精神中不能缺少淡泊.'
        }, {
            id: 15,
            author: '瑞·达利欧',
            book: '原则',
            moto: ' 一个人要以清晰的心智和从容的步履走过岁月,他的精神中不能缺少淡泊.'
        }, {
            id: 16,
            author: '瑞·达利欧',
            book: '原则',
            moto: ' 一个人要以清晰的心智和从容的步履走过岁月,他的精神中不能缺少淡泊.'
        }]
    }
}
